Словарь/src/Catalogs/ЧтенияКанджи/ЧтенияКанджи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЧтенияКанджи</name>
  <attributes>
    <name>ВидЧтения</name>
    <type>
      <types>EnumRef.ВидыЧтенийКанджи</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаРусском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьКаной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Слог</name>
      <type>
        <types>CatalogRef.Слоги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Словарь/src/Enums/ВидыЧтенийКанджи/ВидыЧтенийКанджи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЧтенийКанджи</name>
  <enumValues>
    <name>Онное</name>
  </enumValues>
  <enumValues>
    <name>Кунное</name>
  </enumValues>
</mdclass:Enum>

Словарь/src/Catalogs/ЧтенияКанджи/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Словарь = АзбукаВызовСервера.СоответствиеРомаджиДаннымСлогов();
	Если ДанныеЗаполнения = Неопределено И НЕ ПустаяСтрока(ТекстЗаполнения) Тогда
		Наименование = НРег(ТекстЗаполнения);
		Токены = РаботаСоСтрокамиКлиентСервер.Токенизация(Наименование, Словарь);
		ПриИзмененииНаименования(Токены);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ВидЧтения = ДанныеЗаполнения.ВидЧтения;
		Наименование = НРег(ДанныеЗаполнения.Наименование);
		Токены = РаботаСоСтрокамиКлиентСервер.Токенизация(Наименование, Словарь);
		ПриИзмененииНаименования(Токены);
	КонецЕсли;
КонецПроцедуры

Процедура ПриИзмененииНаименования(Токены) Экспорт
	
	СлогиНаименования = Новый массив;
	Для Каждого Токен Из Токены Цикл
		Если Токен.ЭтоМусор Тогда
			Продолжить;
		КонецЕсли;
		СлогиНаименования.Добавить(Токен.Представление);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = АзбукаВызовСервера.ТекстЗапросаДанныеТокенов();
	Если ВидЧтения = Перечисления.ВидыЧтенийКанджи.Онное Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Слоги.Состав", "Слоги.СоставКатакана");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Слоги.ЗаписьХираганой", "Слоги.ЗаписьКатаканой");		
	КонецЕсли;
	Запрос.УстановитьПараметр("СлогиНаименования", СлогиНаименования);
	ДанныеСлогов = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Состав.Очистить();
	НаименованиеНаРусском = "";
	ЗаписьКаной = "";
	
	Для Каждого Слог Из СлогиНаименования Цикл
		Отбор = Новый Структура("Наименование", Слог);
		ДанныеСлога = ДанныеСлогов.Строки.НайтиСтроки(Отбор)[0];
		НоваяСтрока = Состав.Добавить();
		НоваяСтрока.Слог = ДанныеСлога.Слог;
		Если ДанныеСлога.НаименованиеНаРусском = "сокуон" Тогда
			ДанныеСлога.НаименованиеНаРусском = "_";
		КонецЕсли;
		НаименованиеНаРусском = НаименованиеНаРусском + ДанныеСлога.НаименованиеНаРусском;
		ЗаписьКаной = ЗаписьКаной + ДанныеСлога.ЗаписьКаной;
		
	КонецЦикла;
	
КонецПроцедуры
